# AAAAAAAAAAAAAAAaaaaaaaaaaaaaaahaaaaaaa

In [1]:
import pandas as pd
import numpy as np

np.random.seed(123)

from pydataset import data

In [2]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [3]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [4]:
from env import get_db_url

## 6 Read the employees and titles tables into two separate DataFrames.

In [38]:
url = get_db_url("employees")
sql = """
SELECT * FROM employees
"""

In [39]:
employees = pd.read_sql(sql, url)
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [48]:
url1 = get_db_url("employees")
sql1 = """
SELECT * FROM titles
"""

In [50]:
titles = pd.read_sql(sql1,url1)
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

## 7 How many rows and columns do you have in each DataFrame? Is that what you expected?

In [51]:
titles.shape

(443308, 4)

In [7]:
employees.shape

(300024, 6)

## 8 Display the summary statistics for each DataFrame.

In [8]:
employees.describe(include="all")

               emp_no  birth_date first_name last_name  gender   hire_date
count   300024.000000      300024     300024    300024  300024      300024
unique            NaN        4750       1275      1637       2        5434
top               NaN  1952-03-08     Shahab      Baba       M  1985-06-20
freq              NaN          95        295       226  179973         132
mean    253321.763392         NaN        NaN       NaN     NaN         NaN
std     161828.235540         NaN        NaN       NaN     NaN         NaN
min      10001.000000         NaN        NaN       NaN     NaN         NaN
25%      85006.750000         NaN        NaN       NaN     NaN         NaN
50%     249987.500000         NaN        NaN       NaN     NaN         NaN
75%     424993.250000         NaN        NaN       NaN     NaN         NaN
max     499999.000000         NaN        NaN       NaN     NaN         NaN

In [57]:
employees.value_counts()

emp_no  birth_date  first_name  last_name     gender  hire_date
10001   1953-09-02  Georgi      Facello       M       1986-06-26    1
299980  1953-05-26  Marsal      Lovengreen    M       1988-05-09    1
299996  1958-10-19  Georg       Peck          M       1990-11-21    1
299995  1960-05-30  Arfst       Ertl          M       1990-05-27    1
299994  1963-05-31  Marjo       Ruemmler      M       1985-02-25    1
                                                                   ..
110344  1961-09-07  Rosine      Cools         F       1985-11-22    1
110303  1956-06-08  Krassimir   Wegerle       F       1985-01-01    1
110228  1958-12-02  Karsten     Sigstam       F       1985-08-04    1
110183  1953-06-24  Shirish     Ossenbruggen  F       1985-01-01    1
499999  1958-05-01  Sachin      Tsukuda       M       1997-11-30    1
Length: 300024, dtype: int64

In [58]:
titles.describe(include="all")

               emp_no     title   from_date     to_date
count   443308.000000    443308      443308      443308
unique            NaN         7        6393        5888
top               NaN  Engineer  1998-10-25  9999-01-01
freq              NaN    115003         132      240124
mean    253075.034430       NaN         NaN         NaN
std     161853.292613       NaN         NaN         NaN
min      10001.000000       NaN         NaN         NaN
25%      84855.750000       NaN         NaN         NaN
50%     249847.500000       NaN         NaN         NaN
75%     424891.250000       NaN         NaN         NaN
max     499999.000000       NaN         NaN         NaN

In [60]:
titles.value_counts()

emp_no  title             from_date   to_date
10001   Senior Engineer   1986-06-26  9999-01-01    1
299850  Engineer          1994-06-02  2001-06-02    1
299858  Senior Engineer   1988-06-16  1999-10-04    1
299857  Technique Leader  1991-10-12  9999-01-01    1
299856  Staff             1986-08-15  1992-08-14    1
                                                   ..
109757  Staff             1994-05-07  1995-01-06    1
109756  Senior Engineer   1997-04-30  9999-01-01    1
        Engineer          1991-05-01  1997-04-30    1
109755  Staff             1993-09-13  2000-09-13    1
499999  Engineer          1997-11-30  9999-01-01    1
Length: 443308, dtype: int64

## 9 How many unique titles are in the titles DataFrame?

In [55]:
titles.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

## 10 What is the oldest date in the to_date column?

In [62]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [63]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [68]:
titles[titles.to_date == titles.to_date.max()].head(30)

    emp_no               title   from_date     to_date
0    10001     Senior Engineer  1986-06-26  9999-01-01
1    10002               Staff  1996-08-03  9999-01-01
2    10003     Senior Engineer  1995-12-03  9999-01-01
4    10004     Senior Engineer  1995-12-01  9999-01-01
5    10005        Senior Staff  1996-09-12  9999-01-01
7    10006     Senior Engineer  1990-08-05  9999-01-01
8    10007        Senior Staff  1996-02-11  9999-01-01
13   10009     Senior Engineer  1995-02-18  9999-01-01
14   10010            Engineer  1996-11-24  9999-01-01
17   10012     Senior Engineer  2000-12-18  9999-01-01
18   10013        Senior Staff  1985-10-20  9999-01-01
19   10014            Engineer  1993-12-29  9999-01-01
21   10016               Staff  1998-02-11  9999-01-01
22   10017        Senior Staff  2000-08-03  9999-01-01
25   10018     Senior Engineer  1995-04-03  9999-01-01
26   10019               Staff  1999-04-30  9999-01-01
27   10020            Engineer  1997-12-30  9999-01-01
29   10022            Engineer  1999-09-03  9999-01-01
30   10023            Engineer  1999-09-27  9999-01-01
31   10024  Assistant Engineer  1998-06-14  9999-01-01
34   10026     Senior Engineer  2001-03-19  9999-01-01
36   10027     Senior Engineer  2001-04-01  9999-01-01
39   10029     Senior Engineer  2000-09-17  9999-01-01
41   10030     Senior Engineer  2001-02-17  9999-01-01
43   10031     Senior Engineer  1998-09-01  9999-01-01
45   10032     Senior Engineer  1995-06-20  9999-01-01
49   10035     Senior Engineer  1996-09-05  9999-01-01
50   10036        Senior Staff  1992-04-28  9999-01-01
52   10037     Senior Engineer  1995-12-05  9999-01-01
53   10038        Senior Staff  1996-09-20  9999-01-01

## 11 What is the most recent date in the to_date column?

In [69]:
titles[titles.from_date == titles.from_date.max()].head(50)

        emp_no            title   from_date     to_date
17374    21763     Senior Staff  2002-08-01  9999-01-01
23635    26000     Senior Staff  2002-08-01  9999-01-01
67904    55876     Senior Staff  2002-08-01  9999-01-01
80194    64174  Senior Engineer  2002-08-01  9999-01-01
116305   88539     Senior Staff  2002-08-01  9999-01-01
118696   90134     Senior Staff  2002-08-01  9999-01-01
119479   90666  Senior Engineer  2002-08-01  9999-01-01
128289   96599  Senior Engineer  2002-08-01  9999-01-01
135653  101563     Senior Staff  2002-08-01  9999-01-01
143272  106707     Senior Staff  2002-08-01  9999-01-01
154943  204587  Senior Engineer  2002-08-01  9999-01-01
158108  206731  Senior Engineer  2002-08-01  9999-01-01
164221  210868  Senior Engineer  2002-08-01  9999-01-01
177342  219722         Engineer  2002-08-01  9999-01-01
197365  233339  Senior Engineer  2002-08-01  9999-01-01
197393  233358     Senior Staff  2002-08-01  9999-01-01
203062  237207  Senior Engineer  2002-08-01  9999-01-01
235814  259430  Senior Engineer  2002-08-01  9999-01-01
280178  289500     Senior Staff  2002-08-01  9999-01-01
291838  297339     Senior Staff  2002-08-01  9999-01-01
304109  405703  Senior Engineer  2002-08-01  9999-01-01
308445  408664     Senior Staff  2002-08-01  9999-01-01
320377  416723         Engineer  2002-08-01  9999-01-01
365959  447596     Senior Staff  2002-08-01  9999-01-01
373714  452819  Senior Engineer  2002-08-01  9999-01-01
387241  461960     Senior Staff  2002-08-01  9999-01-01
436755  495525     Senior Staff  2002-08-01  9999-01-01

# Excersize 2

## 1 Copy the users and roles DataFrames from the examples above.

In [11]:
# Create the users DataFrame.
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [12]:
# Create the roles DataFrame
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

## 2 What is the result of using a right join on the DataFrames?

In [14]:
users.merge(roles, how="right")

   id       name  role_id
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN

## 3 What is the result of using an outer join on the DataFrames?

In [70]:
users.merge(roles, how="outer")

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
6   1      admin      NaN
7   2     author      NaN
8   3   reviewer      NaN
9   4  commenter      NaN

## 4 What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
#ummm  what does that even mean
#like tf,,?
#bruh how do i even find the foreign keys in the first place

In [16]:
mpg = data("mpg")
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [17]:
mpg.shape

(234, 11)

In [18]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [19]:
mpg.size

2574

In [20]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [21]:
mpg.describe(include="all")

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
count,234,234,234.000000,234.000000,234.000000,234,234,234.000000,234.000000,234,234
unique,15,38,NaN,NaN,NaN,10,3,NaN,NaN,5,7
top,dodge,caravan 2wd,NaN,NaN,NaN,auto(l4),f,NaN,NaN,r,suv
freq,37,11,NaN,NaN,NaN,83,106,NaN,NaN,168,62
mean,NaN,NaN,3.471795,2003.500000,5.888889,NaN,NaN,16.858974,23.440171,NaN,NaN
std,NaN,NaN,1.291959,4.509646,1.611534,NaN,NaN,4.255946,5.954643,NaN,NaN
min,NaN,NaN,1.600000,1999.000000,4.000000,NaN,NaN,9.000000,12.000000,NaN,NaN
25%,NaN,NaN,2.400000,1999.000000,4.000000,NaN,NaN,14.000000,18.000000,NaN,NaN
50%,NaN,NaN,3.300000,2003.500000,6.000000,NaN,NaN,17.000000,24.000000,NaN,NaN
75%,NaN,NaN,4.600000,2008.000000,8.000000,NaN,NaN,19.000000,27.000000,NaN,NaN
max,NaN,NaN,7.000000,2008.000000,8.000000,NaN,NaN,35.000000,44.000000,NaN,NaN

In [22]:
# mpg.value_counts(by="manufacturer")

In [23]:
mpg[('manufacturer')]

1            audi
2            audi
3            audi
4            audi
5            audi
          ...
230    volkswagen
231    volkswagen
232    volkswagen
233    volkswagen
234    volkswagen
Name: manufacturer, Length: 234, dtype: object

In [24]:
mpg.manufacturer.unique()

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

In [25]:
len(mpg.manufacturer.unique())

15

In [26]:
mpg.model.unique()

array(['a4', 'a4 quattro', 'a6 quattro', 'c1500 suburban 2wd', 'corvette',
       'k1500 tahoe 4wd', 'malibu', 'caravan 2wd', 'dakota pickup 4wd',
       'durango 4wd', 'ram 1500 pickup 4wd', 'expedition 2wd',
       'explorer 4wd', 'f150 pickup 4wd', 'mustang', 'civic', 'sonata',
       'tiburon', 'grand cherokee 4wd', 'range rover', 'navigator 2wd',
       'mountaineer 4wd', 'altima', 'maxima', 'pathfinder 4wd',
       'grand prix', 'forester awd', 'impreza awd', '4runner 4wd',
       'camry', 'camry solara', 'corolla', 'land cruiser wagon 4wd',
       'toyota tacoma 4wd', 'gti', 'jetta', 'new beetle', 'passat'],
      dtype=object)

In [27]:
len(mpg.model.unique())

38

In [28]:
mpg["mileage_difference"] = mpg.hwy - mpg.cty
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

In [29]:
mpg["average_mileage"] = (mpg.cty + mpg.hwy) / 2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [30]:
# mpg["is_automatic"] = trans == auto
bools = mpg.trans.str.startswith('a')
bools

1       True
2      False
3      False
4       True
5       True
       ...
230     True
231    False
232     True
233    False
234     True
Name: trans, Length: 234, dtype: bool

In [37]:
mpg["is_automatic"] = mpg.trans.str.startswith('a')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

In [32]:
mpg.groupby('manufacturer').math.agg(['min', 'mean', 'max'])

AttributeError: 'DataFrameGroupBy' object has no attribute 'math'